sckim/Stm32NucleoF103RB/Examples/10_Flash_CRC/02_CRC_Unit_HAL_c/Core/Inc/stm32f1xx_hal_conf.h
/**
 * stm32f1xx_hal_conf.h — 이 과목에서 쓰는 모든 주변장치 모듈을 미리 켜 둔 설정.
 * 보통은 CubeMX가 주변장치를 추가할 때마다 자동으로 관리해 준다. PlatformIO에서는
 * 수동으로 유지하므로, 새 모듈이 필요하면 아래 XXX_MODULE_ENABLED 한 줄만 추가하면 된다.
 */
#ifndef __STM32F1xx_HAL_CONF_H
#define __STM32F1xx_HAL_CONF_H

#ifdef __cplusplus
extern "C" {
#endif

/* ---- 이 과목(W1~W14)에서 사용하는 HAL 모듈 ---- */
#define HAL_MODULE_ENABLED
#define HAL_ADC_MODULE_ENABLED
#define HAL_CRC_MODULE_ENABLED
#define HAL_CORTEX_MODULE_ENABLED
#define HAL_DMA_MODULE_ENABLED
#define HAL_EXTI_MODULE_ENABLED
#define HAL_FLASH_MODULE_ENABLED
#define HAL_GPIO_MODULE_ENABLED
#define HAL_I2C_MODULE_ENABLED
#define HAL_IWDG_MODULE_ENABLED
#define HAL_PWR_MODULE_ENABLED
#define HAL_RCC_MODULE_ENABLED
#define HAL_RTC_MODULE_ENABLED
#define HAL_SPI_MODULE_ENABLED
#define HAL_TIM_MODULE_ENABLED
#define HAL_UART_MODULE_ENABLED
#define HAL_WWDG_MODULE_ENABLED

/* ---- 오실레이터/전압 파라미터 (Nucleo-F103RB 기준) ---- */
#if !defined(HSE_VALUE)
#define HSE_VALUE 8000000U     /* ST-LINK MCO를 통한 8MHz */
#endif
#if !defined(HSE_STARTUP_TIMEOUT)
#define HSE_STARTUP_TIMEOUT 100U
#endif
#if !defined(HSI_VALUE)
#define HSI_VALUE 8000000U
#endif
#if !defined(LSE_VALUE)
#define LSE_VALUE 32768U       /* W13 RTC에서 사용 */
#endif
#if !defined(LSE_STARTUP_TIMEOUT)
#define LSE_STARTUP_TIMEOUT 5000U
#endif
#if !defined(LSI_VALUE)
#define LSI_VALUE 40000U
#endif

#define VDD_VALUE 3300U
#define TICK_INT_PRIORITY 0U
#define USE_RTOS 0U
#define PREFETCH_ENABLE 1U

#include "stm32f1xx_hal_rcc.h"
#include "stm32f1xx_hal_gpio.h"
#include "stm32f1xx_hal_exti.h"
#include "stm32f1xx_hal_dma.h"
#include "stm32f1xx_hal_cortex.h"
#include "stm32f1xx_hal_flash.h"
#include "stm32f1xx_hal_pwr.h"
#include "stm32f1xx_hal_adc.h"
#include "stm32f1xx_hal_tim.h"
#include "stm32f1xx_hal_uart.h"
#include "stm32f1xx_hal_i2c.h"
#include "stm32f1xx_hal_spi.h"
#include "stm32f1xx_hal_rtc.h"
#include "stm32f1xx_hal_iwdg.h"
#include "stm32f1xx_hal_wwdg.h"
#include "stm32f1xx_hal_crc.h"

#ifdef USE_FULL_ASSERT
#define assert_param(expr) ((expr) ? (void)0U : assert_failed((uint8_t *)__FILE__, __LINE__))
void assert_failed(uint8_t *file, uint32_t line);
#else
#define assert_param(expr) ((void)0U)
#endif

#ifdef __cplusplus
}
#endif

#endif /* __STM32F1xx_HAL_CONF_H */
